# количество выполненных ДЗ (запишите значение 12)
homework_done = 12
# количество затраченных часов (запишите значение 1.5)
hours_spent = 1.5
# название курса (запишите значение 'Python')
course_name = 'Python'
# время на одно задание (вычислить используя 1 и 2 переменные)
time_task = hours_spent / homework_done
# вывод
print(f"Курс: {course_name}, всего задач: {homework_done}, затрачено часов: {hours_spent}, среднее время выполнения {time_task:} часа.")
# я почитала в интернете, думаю в последней строке ( среднее время выполнения {time_task:.3f} часа. ") отформатировать, но пока не стала