# Создание переменную name и присвоение ей значение  имени (строка)
name = 'Elina'
# Вывод значения переменной name на экран
print("Name:", name)
#print("Name:", name, type(name)) - можно и так вывести, чтобы удостовериться в типе данных
# Создание переменной age и присвоение ей значения  возраста (целое число)
age = 23
# Вывод значения переменной age на экран
print("Age:", age)
#print("Age:", age, type(age)) - можно и так вывести, чтобы удостовериться в типе данных
# Перезапиcь в age текущего значения переменной age + новое
age = age + 1
# Вывод измененного значения переменной age на экран
print("New Age:", age)
#print("New Age:", age + new_age,type(new_age) )- можно и так вывести, чтобы удостовериться в типе данных
# Создание переменной is_student и присвоение ей значения True (логическое значение)
is_Student = True
# Вывод значения переменной is_student на экран
print("is_Student:", is_Student)
#print("is_Student:", is_Student, type(is_Student))- можно и так вывести, чтобы удостовериться в типе данных