# Ввод произвольного текста
my_string = input("Введите текст: ")
# Вывод количества символов в строке
print("Количество символов:", len(my_string))
# Вывод строки в верхнем регистре
print("Строка в верхнем регистре:", my_string.upper())
# Вывод строки в нижнем регистре
print("Строка в нижнем регистре:", my_string.lower())
# Удаление всех пробелов из строки
print("Строка без пробелов:", my_string.replace(" ", ""))
# Вывод первого символа строки
print("Первый символ:", my_string[0])
# Вывод последнего символа строки
print("Последний символ:", my_string[-1])
